__LoadDiagrams/SampleTestOriginalAD.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Azure Load Testing Quickstart" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Web endpoint test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp> <!-- Loop Count -->
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp> <!-- Number of Users -->
        <stringProp name="ThreadGroup.ramp_time">10</stringProp> <!-- Ramp Up Period -->
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">5</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">assignments-xcqoka5hm.azurewebsites.net</stringProp> <!-- domain of the assignments -->
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/assignments/NQ==_MTQ1</stringProp> <!-- path of the assignments -->
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsIng1dCI6IjJaUXBKM1VwYmpBWVhZR2FYRUpsOGxWMFRPSSIsImtpZCI6IjJaUXBKM1VwYmpBWVhZR2FYRUpsOGxWMFRPSSJ9.eyJhdWQiOiJhcGk6Ly82ODZlOGI2My0zNGZkLTQ5ZDYtYTQwNy0xOGVkY2NlZmMwY2QiLCJpc3MiOiJodHRwczovL3N0cy53aW5kb3dzLm5ldC8yMTUxMGJiOS02NDE0LTQ2ZDAtOWEwNy0xZmFmOThmMjU5MzcvIiwiaWF0IjoxNjYxMzU1MDQ2LCJuYmYiOjE2NjEzNTUwNDYsImV4cCI6MTY2MTM1OTgzMiwiYWNyIjoiMSIsImFpbyI6IkFkUUFLLzhUQUFBQW9iVUJVL21WelpRUUdvVzRqcXJxWUhDMGtVRGljWm9iNXM3SitDY2VzOUhWTGtOZ2dPaGdIU2lISlJUb0NWVDM3V05YN2tuZ0E3UGV4cDNxWDFyKzkvL3FqcVRoZGVMbThHVmpnUUFsNERibHlzeW5oRmRYWXZjK1NtQ0NXeUEwU1V2cGhUWlZ6RjZHQk5yc2RlQ04rTHFkMCswRnorVHhHa0Y4bE9Fc0J6ZHU5NjZGWkpTTldScFZOSk9wN282WU1STGtQL0FVU29wUGVnc1U2K01OZ1VhWXJBaFo5TGxzV2pxRDBhd0dHNU5EcDE0d2h3bGVFRHVRUU5PWVZCWktaWm1IVE9PSkdyYkNrWVFrVVVzWkd3PT0iLCJhbXIiOlsicHdkIl0sImFwcGlkIjoiNjg2ZThiNjMtMzRmZC00OWQ2LWE0MDctMThlZGNjZWZjMGNkIiwiYXBwaWRhY3IiOiIwIiwiZW1haWwiOiJ0aWFuY2hlbi56aGFuZy4xOEB1Y2wuYWMudWsiLCJmYW1pbHlfbmFtZSI6IlpoYW5nIiwiZ2l2ZW5fbmFtZSI6IlRpYW5jaGVuIiwiaWRwIjoiaHR0cHM6Ly9zdHMud2luZG93cy5uZXQvMWZhZjg4ZmUtYTk5OC00YzViLTkzYzktMjEwYTExZDlhNWMyLyIsImlwYWRkciI6IjUuMTUxLjg5LjMyIiwibmFtZSI6IlpoYW5nLCBUaWFuY2hlbiIsIm9pZCI6Ijk2MDFmOWM2LTY1YmEtNDgzNi04MGMzLTY3NmZmZDdjNjBhYSIsInJoIjoiMC5BWGtBdVF0UklSUmswRWFhQngtdm1QSlpOMk9MYm1qOU5OWkpwQWNZN2N6dndNMlVBRFUuIiwic2NwIjoidXNlcl9pbXBlcnNvbmF0aW9uIiwic3ViIjoiYzh5U05vLWVOSmJRdElERl9KX0FYczlTM2t0WWV1X21va2JvTzJQVFZDYyIsInRpZCI6IjIxNTEwYmI5LTY0MTQtNDZkMC05YTA3LTFmYWY5OGYyNTkzNyIsInVuaXF1ZV9uYW1lIjoidGlhbmNoZW4uemhhbmcuMThAdWNsLmFjLnVrIiwidXRpIjoiSWNSc3EyaEV3a3VEaXAtS1laV0VBQSIsInZlciI6IjEuMCJ9.eVr_RWxtR3OV9En4Le_GM6MUv3_wBDvJbrqGJPttQ2jDagw7rasZR4z5sOOYHTjDsXFiUEEBuTXYZnKOcuHXPnESdtSN5vASgblLMgIP4rgFwrbocX-dQpM9PVfTgYNWCMhjBEnyw03NvpkGq0GsemQZvvXVGU0yJ54nPGkQHsRSOhMF5-wFJH3XOpI-Xd_6Yd1vZl3uAqQroIblZa7DEVLZ_cMDrB8PVicyzoRmo7S08zYEUMelyoKtKfv04bUi7yEcZ6qS70G6PkFQnNBxv7eyrwpIpWQLUnJo-q6r1XRXhsTXGKmdUAN7HaUzFtdNImaVt1IYbwgnfdcQ0ceWTA</stringProp> <!-- bearer token from the assignment -->
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>