__LoadDiagrams/SampleTestOurAD.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Azure Load Testing Quickstart" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Web endpoint test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp> <!-- Loop Count -->
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp> <!-- Number of Users -->
        <stringProp name="ThreadGroup.ramp_time">10</stringProp> <!-- Ramp Up Period -->
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">5</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">assignments-vbohkl5b4.azurewebsites.net</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/assignments/NQ==_MTQ3</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6IjJaUXBKM1VwYmpBWVhZR2FYRUpsOGxWMFRPSSJ9.eyJhdWQiOiIwNmViMTM2My1jYjVhLTQyMTgtYjRmMi02MGIxNTYyMDMwMmYiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vMjE1MTBiYjktNjQxNC00NmQwLTlhMDctMWZhZjk4ZjI1OTM3L3YyLjAiLCJpYXQiOjE2NjE0MzYyNTksIm5iZiI6MTY2MTQzNjI1OSwiZXhwIjoxNjYxNDQxMjY5LCJhaW8iOiJBVFFBeS84VEFBQUFxTVNLa1N4czRMSTNOTmxIcGszUWJod0hCNU1OcEFjWkhwczlhVkpTZnUwZkZTUWg3RWNwK0VaUVQwaEFLTVVMIiwiYXpwIjoiMDZlYjEzNjMtY2I1YS00MjE4LWI0ZjItNjBiMTU2MjAzMDJmIiwiYXpwYWNyIjoiMCIsImVtYWlsIjoiY2hyaXNAdWNsbXNjbGVhcm5sdGkub25taWNyb3NvZnQuY29tIiwiZmFtaWx5X25hbWUiOiJncmVlbiIsImdpdmVuX25hbWUiOiJjaHJpcyIsIm5hbWUiOiJjaHJpc2dyZWVuIiwib2lkIjoiNTg2ZGI2MjEtMWU5Mi00MGNlLWE4MzYtZmU0NGI5YTVkM2JjIiwicHJlZmVycmVkX3VzZXJuYW1lIjoiY2hyaXNAdWNsbXNjbGVhcm5sdGkub25taWNyb3NvZnQuY29tIiwicmgiOiIwLkFYa0F1UXRSSVJSazBFYWFCeC12bVBKWk4yTVQ2d1pheXhoQ3RQSmdzVllnTUMtVUFGOC4iLCJzY3AiOiJ1c2VyX2ltcGVyc29uYXRpb24iLCJzdWIiOiJMMTBIVWJZcndHTF9CU3Q3dnc3b29sYUI5YXYyajJ0TEM0VW40VWY1bUc4IiwidGlkIjoiMjE1MTBiYjktNjQxNC00NmQwLTlhMDctMWZhZjk4ZjI1OTM3IiwidXRpIjoiSy0tME0xY2taVUNUNVRpS0djWWhBQSIsInZlciI6IjIuMCJ9.b--GpDnzk95QN8YBIU3LcklAfbxnKD1QkffaWBQCouB6ePsv88TxnEhafu6IQ7T52ionWz3IaC071gfOqd1CqJF4MC0yrNbnmXsNs606PYy_yPGrRH8uMu_578FbvwNeiUkS11_3Ju_m05r5mrh2daSO67Wn1gZ5VnQ3s2lqvm2gK2a9oX_Cf6UG7HdsNSyk5hAXobWUiQSF6y5XNZsxkPUtrPAWfSNsJvWNtmfKDgm-hkHgvW987TMXLqfWqIW5Iy7K-eMBoYRHPp0zqJRbszc0r-SHeUr5TswbE06su_vSrEpH6g3tjPDi32loiNbiL1Vd_fuPgeKmvMJwJBqARQ</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>